# Ch05-1 Pandas DataFrame 資料處理

# 安裝 pandas
若有語法不了解的地方，可以參考以下連結:
- [API reference](https://pandas.pydata.org/docs/reference/index.html)
- [Pandas Tutorial](https://www.w3schools.com/python/pandas/default.asp)
- [Pandas 教程](https://www.runoob.com/pandas/pandas-tutorial.html)

In [194]:
# 安裝套件
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\xdxd2\appdata\roaming\python\python310\site-packages (1.5.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\program files\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\program files\python310\lib\site-packages (from pandas) (2022.2.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\xdxd2\appdata\roaming\python\python310\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\program files\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [195]:
import numpy as np
import pandas as pd
from pprint import pprint

In [196]:
pd.__version__

'1.5.0'

## 四則運算
- add(): 加法
- sub(): 減法
- mul(): 乘法
- div(): 除法

`註: series 跟 dataframe 都可以用`

In [197]:
# 初始化
df1 = pd.DataFrame([
    {'a': 15, 'b': 15}, 
    {'a': 12, 'b': 18}
])
df2 = pd.DataFrame([
    {'a': 15, 'b': 13}, 
    {'a': 11, 'b': 22}
])

In [198]:
df1

    a   b
0  15  15
1  12  18

In [199]:
df2

    a   b
0  15  13
1  11  22

In [200]:
# 加法
df1 + df2

    a   b
0  30  28
1  23  40

In [201]:
# 加法
df1.add(df2)

    a   b
0  30  28
1  23  40

In [202]:
# 減法
df1 - df2

   a  b
0  0  2
1  1 -4

In [203]:
# 減法
df1.sub(df2)

   a  b
0  0  2
1  1 -4

In [204]:
# 除法
df1/df2

          a         b
0  1.000000  1.153846
1  1.090909  0.818182

In [205]:
# 除法
df1.divide(df2)

          a         b
0  1.000000  1.153846
1  1.090909  0.818182

In [206]:
df1.div(df2)

          a         b
0  1.000000  1.153846
1  1.090909  0.818182

In [207]:
# 乘法
# 注意這個是 同樣位置互乘
df1.mul(df2)

     a    b
0  225  195
1  132  396

In [208]:
df1 * df2

     a    b
0  225  195
1  132  396

In [209]:
df1.multiply(df2)

     a    b
0  225  195
1  132  396

# 邏輯運算方法
- **gt()**: 大於
- **lt()**: 小於
- **ge()**: 大於等於
- **le()**: 小於等於
- **eq()**: 等於
- **ne()**: 不等於

`註: series 跟 dataframe 都可以用`

In [210]:
df1

    a   b
0  15  15
1  12  18

In [211]:
df2

    a   b
0  15  13
1  11  22

In [212]:
# gt(): 大於
df = df1.gt(df2); df

       a      b
0  False   True
1   True  False

In [213]:
# lt(): 小於
df = df1.lt(df2); df

       a      b
0  False  False
1  False   True

In [214]:
# gt(): 大於
df = df1.gt(df2); df

       a      b
0  False   True
1   True  False

In [215]:
# le(): 小於等於
df = df1.le(df2); df

       a      b
0   True  False
1  False   True

In [216]:
# eq(): 等於
df = df1.eq(df2); df

       a      b
0   True  False
1  False  False

In [217]:
# ne(): 不等於
df = df1.ne(df2); df

       a     b
0  False  True
1   True  True

## 空缺值處理
- df.**dropna()**: 將 NaN `刪除`，再回傳新的 series 或 dataframe 物件。
- df.**fillna()**: 將 NaN 由特定的 value `取代`，再回傳新的 series 或 dataframe 物件。
- df.**isna()**: 判斷是否為 NaN，如果`是`，就回傳 True，如果不是，就回傳 False。
- df.**notna()**: 判斷是否為 NaN，如果`不是`，就回傳 True，如果是，就回傳 False。
- df.**isnull()**: 跟 df.**isna()** 一樣。

### df.isna(), df.isnull()

In [218]:
# 創建一個包含空缺值的示例 DataFrame
data = {'A': [1, 2, np.nan, 4, 5],
        'B': [6, np.nan, 8, np.nan, 10],
        'C': [100, np.nan, 3, 3, 11],
        'D': [2, 23, 44, 66, 77]}
df = pd.DataFrame(data); df

     A     B      C   D
0  1.0   6.0  100.0   2
1  2.0   NaN    NaN  23
2  NaN   8.0    3.0  44
3  4.0   NaN    3.0  66
4  5.0  10.0   11.0  77

In [219]:
# 判斷空缺值
df1 = df.copy()
df1.isna()

       A      B      C      D
0  False  False  False  False
1  False   True   True  False
2   True  False  False  False
3  False   True  False  False
4  False  False  False  False

In [220]:
# 統計空缺值
df1.isna().sum()

A    1
B    2
C    1
D    0
dtype: int64

In [221]:
# 判斷空缺值
df1.isnull()

       A      B      C      D
0  False  False  False  False
1  False   True   True  False
2   True  False  False  False
3  False   True  False  False
4  False  False  False  False

In [222]:
# 統計空缺值
df1.isnull().sum()

A    1
B    2
C    1
D    0
dtype: int64

### df.dropna()

In [223]:
df.dropna()

     A     B      C   D
0  1.0   6.0  100.0   2
4  5.0  10.0   11.0  77

In [224]:
df.dropna(axis=1)

    D
0   2
1  23
2  44
3  66
4  77

In [225]:
df.dropna(axis=0)

     A     B      C   D
0  1.0   6.0  100.0   2
4  5.0  10.0   11.0  77

### df.fillna()

這個方法可用於填充空缺值，您可以通過指定一個固定值或者使用不同的填充策略（例如平均值、中位數等）。

In [226]:
# 使用固定值填充空缺值
df.fillna(10000)

         A        B        C   D
0      1.0      6.0    100.0   2
1      2.0  10000.0  10000.0  23
2  10000.0      8.0      3.0  44
3      4.0  10000.0      3.0  66
4      5.0     10.0     11.0  77

In [227]:
# 使用平均值填充空缺值
df.fillna(df.mean())

     A     B       C   D
0  1.0   6.0  100.00   2
1  2.0   8.0   29.25  23
2  3.0   8.0    3.00  44
3  4.0   8.0    3.00  66
4  5.0  10.0   11.00  77

### df.interpolate()
這個方法可以根據數據的趨勢進行插值填充，適用於連續性數據。

In [228]:
# 根據數據的趨勢進行插值填充
df.interpolate()

     A     B      C   D
0  1.0   6.0  100.0   2
1  2.0   7.0   51.5  23
2  3.0   8.0    3.0  44
3  4.0   9.0    3.0  66
4  5.0  10.0   11.0  77

### df.replace()
這個方法可以用於將指定的空缺值替換為其他值

In [229]:
df.replace(np.nan, 202311)

          A         B         C   D
0       1.0       6.0     100.0   2
1       2.0  202311.0  202311.0  23
2  202311.0       8.0       3.0  44
3       4.0  202311.0       3.0  66
4       5.0      10.0      11.0  77

In [230]:
df.replace(3, 30000)

     A     B        C   D
0  1.0   6.0    100.0   2
1  2.0   NaN      NaN  23
2  NaN   8.0  30000.0  44
3  4.0   NaN  30000.0  66
4  5.0  10.0     11.0  77

### 自定義函數處理空缺值
使用自定義函數來處理空缺值，然後使用 apply() 函數應用它。

In [246]:
df_fill_func_na = df.copy()


# 定義一個自定義函數來處理空缺值
def fill_na_with_sum_x100(column):
    column_sum = column.sum() * 100
    return column.fillna(column_mean)

def fill_na_with_mean(column):
    column_mean = column.mean()
    return column.fillna(column_mean)

df_fill_func_na['C'] = df[["C"]].apply(fill_na_with_mean)
df_fill_func_na['A'] = df[["A"]].apply(fill_na_with_sum_x100)

df_fill_func_na

       A     B       C   D
0    1.0   6.0  100.00   2
1    2.0   NaN   29.25  23
2  120.0   8.0    3.00  44
3    4.0   NaN    3.00  66
4    5.0  10.0   11.00  77

# 簡單的統計函數
- **cummax**(axis=None): 回傳指定軸所累計的最大值。
- **cummin**(axis=None): 回傳指定軸所累計的最小值。 
- **cumsum**(axis=None): 回傳指定軸所累計的總和。
- **max**(axis=None): 回傳指定軸的最大值。
- **min**(axis=None): 回傳指定軸的最小值。
- **sum**(axis=None): 回傳指定軸的總和。
- **mean**(axis=None): 回傳指定軸的平均數。
- **median**(axis=None): 回傳指定軸的中位數。
- **std**(axis=None): 回傳指定軸的標準差。

In [265]:
import pandas as pd
import numpy as np
from random import randint

course = ["國文", "英文", "數學", "自然", "社會", "操行", "等級"]

chinese = [randint(60, 100) for x in range(7)]
english = [randint(60, 100) for x in range(7)]
math = [randint(60, 100) for x in range(7)]
nature = [randint(60, 100) for x in range(7)]
society = [randint(60, 100) for x in range(7)]
grade = ["A", "A-","A+", "B","A","A+","A"]
level = [randint(0, 5) for x in range(7)]

  
data = {
    "國文" : chinese,
    "英文" : english,
    "數學" : math,
    "自然" : nature,
    "社會" : society,
    "操行" : grade,
    "等級" : level,
}

df_student = pd.DataFrame(data)

df_student

   國文  英文  數學  自然   社會  操行  等級
0  83  99  89  92   97   A   2
1  81  95  92  60   74  A-   1
2  75  67  66  72   60  A+   0
3  74  76  96  96  100   B   4
4  82  94  89  92   83   A   3
5  99  76  95  94   90  A+   4
6  91  72  94  73   71   A   3

In [267]:
# 轉換寬格式為長格式
df_long = df_student.melt(id_vars=['操行', "等級"], 
                          value_vars=course[:6], 
                          var_name='科目', 
                          value_name='成績')
df_long

    操行  等級  科目   成績
0    A   2  國文   83
1   A-   1  國文   81
2   A+   0  國文   75
3    B   4  國文   74
4    A   3  國文   82
5   A+   4  國文   99
6    A   3  國文   91
7    A   2  英文   99
8   A-   1  英文   95
9   A+   0  英文   67
10   B   4  英文   76
11   A   3  英文   94
12  A+   4  英文   76
13   A   3  英文   72
14   A   2  數學   89
15  A-   1  數學   92
16  A+   0  數學   66
17   B   4  數學   96
18   A   3  數學   89
19  A+   4  數學   95
20   A   3  數學   94
21   A   2  自然   92
22  A-   1  自然   60
23  A+   0  自然   72
24   B   4  自然   96
25   A   3  自然   92
26  A+   4  自然   94
27   A   3  自然   73
28   A   2  社會   97
29  A-   1  社會   74
30  A+   0  社會   60
31   B   4  社會  100
32   A   3  社會   83
33  A+   4  社會   90
34   A   3  社會   71

In [271]:
# 累計國文的分數，另外新增一個欄位來放置它
x = df_student['國文'].cumsum()
df_student['小計_國文'] = x; df_student

   國文  英文  數學  自然   社會  操行  等級  小計_國文
0  83  99  89  92   97   A   2     83
1  81  95  92  60   74  A-   1    164
2  75  67  66  72   60  A+   0    239
3  74  76  96  96  100   B   4    313
4  82  94  89  92   83   A   3    395
5  99  76  95  94   90  A+   4    494
6  91  72  94  73   71   A   3    585

In [272]:
# 補充: 刪除 column 的資料
'''
也可以刪除多個 columns:
df = df.drop(columns=['column_nameA', 'column_nameB'])
'''
df_student = df_student.drop('小計_國文', axis=1); df_student

   國文  英文  數學  自然   社會  操行  等級
0  83  99  89  92   97   A   2
1  81  95  92  60   74  A-   1
2  75  67  66  72   60  A+   0
3  74  76  96  96  100   B   4
4  82  94  89  92   83   A   3
5  99  76  95  94   90  A+   4
6  91  72  94  73   71   A   3

In [278]:
# 列出每一個學生的總分，另外新增一個欄位來放置它
total = [df_student.iloc[i, :5].sum() for i in range(0, 7)]
df_student['總分'] = total; df_student

   國文  英文  數學  自然   社會  操行  等級   總分
0  83  99  89  92   97   A   2  460
1  81  95  92  60   74  A-   1  402
2  75  67  66  72   60  A+   0  340
3  74  76  96  96  100   B   4  442
4  82  94  89  92   83   A   3  440
5  99  76  95  94   90  A+   4  454
6  91  72  94  73   71   A   3  401

In [280]:
# 列出各科平均分數 (包括總分的平均分數)
avg = df_student.mean(); avg

C:\Users\xdxd2\AppData\Local\Temp\ipykernel_30712\3242775415.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  avg = df_student.mean(); avg

國文     83.571429
英文     82.714286
數學     88.714286
自然     82.714286
社會     82.142857
等級      2.428571
總分    419.857143
dtype: float64

In [281]:
# 增加 index: 在 df 下方增加平均分數
df_student.loc['平均分數'] = avg; df_student

,國文,英文,數學,自然,社會,操行,等級,總分
0,83.000000,99.000000,89.000000,92.000000,97.000000,A,2.000000,460.000000
1,81.000000,95.000000,92.000000,60.000000,74.000000,A-,1.000000,402.000000
2,75.000000,67.000000,66.000000,72.000000,60.000000,A+,0.000000,340.000000
3,74.000000,76.000000,96.000000,96.000000,100.000000,B,4.000000,442.000000
4,82.000000,94.000000,89.000000,92.000000,83.000000,A,3.000000,440.000000
5,99.000000,76.000000,95.000000,94.000000,90.000000,A+,4.000000,454.000000
6,91.000000,72.000000,94.000000,73.000000,71.000000,A,3.000000,401.000000
平均分數,83.571429,82.714286,88.714286,82.714286,82.142857,NaN,2.428571,419.857143

In [282]:
# 刪除 index: 刪除 平均分數 的 row
'''
也可以這樣寫:
df = df.drop(index=['平均分數'])
'''
df_student = df_student.drop('平均分數', axis=0); df_student

     國文    英文    數學    自然     社會  操行   等級     總分
0  83.0  99.0  89.0  92.0   97.0   A  2.0  460.0
1  81.0  95.0  92.0  60.0   74.0  A-  1.0  402.0
2  75.0  67.0  66.0  72.0   60.0  A+  0.0  340.0
3  74.0  76.0  96.0  96.0  100.0   B  4.0  442.0
4  82.0  94.0  89.0  92.0   83.0   A  3.0  440.0
5  99.0  76.0  95.0  94.0   90.0  A+  4.0  454.0
6  91.0  72.0  94.0  73.0   71.0   A  3.0  401.0

In [283]:
# 排序: 將 dataframe 物件的 總分 欄位，從大排到小
df_student = df_student.sort_values(by='總分', ascending=False); df_student

     國文    英文    數學    自然     社會  操行   等級     總分
0  83.0  99.0  89.0  92.0   97.0   A  2.0  460.0
5  99.0  76.0  95.0  94.0   90.0  A+  4.0  454.0
3  74.0  76.0  96.0  96.0  100.0   B  4.0  442.0
4  82.0  94.0  89.0  92.0   83.0   A  3.0  440.0
1  81.0  95.0  92.0  60.0   74.0  A-  1.0  402.0
6  91.0  72.0  94.0  73.0   71.0   A  3.0  401.0
2  75.0  67.0  66.0  72.0   60.0  A+  0.0  340.0

In [285]:
# 經過大到小的排序後，增加名次欄位
rank = range(1, 8)
df_student['名次'] = rank; df_student

     國文    英文    數學    自然     社會  操行   等級     總分  名次
0  83.0  99.0  89.0  92.0   97.0   A  2.0  460.0   1
5  99.0  76.0  95.0  94.0   90.0  A+  4.0  454.0   2
3  74.0  76.0  96.0  96.0  100.0   B  4.0  442.0   3
4  82.0  94.0  89.0  92.0   83.0   A  3.0  440.0   4
1  81.0  95.0  92.0  60.0   74.0  A-  1.0  402.0   5
6  91.0  72.0  94.0  73.0   71.0   A  3.0  401.0   6
2  75.0  67.0  66.0  72.0   60.0  A+  0.0  340.0   7

In [286]:
# 依 index 從新排序
df_student = df_student.sort_index(ascending=True); df_student

     國文    英文    數學    自然     社會  操行   等級     總分  名次
0  83.0  99.0  89.0  92.0   97.0   A  2.0  460.0   1
1  81.0  95.0  92.0  60.0   74.0  A-  1.0  402.0   5
2  75.0  67.0  66.0  72.0   60.0  A+  0.0  340.0   7
3  74.0  76.0  96.0  96.0  100.0   B  4.0  442.0   3
4  82.0  94.0  89.0  92.0   83.0   A  3.0  440.0   4
5  99.0  76.0  95.0  94.0   90.0  A+  4.0  454.0   2
6  91.0  72.0  94.0  73.0   71.0   A  3.0  401.0   6

## 分組聚合

In [309]:
import pandas as pd
import random

# 創建虛擬的銷售數據
data = {
    '日期': pd.date_range(start='2023-01-01', end='2023-01-10', freq='D'),
    '公司名稱': ['公司A', '公司B', '公司C', '公司A', '公司B', '公司C', '公司A', '公司B', '公司C', '公司A'],
    '銷售量': [random.randint(10, 100) for _ in range(10)],
    '銷售金額-USD': [random.randint(100, 1000) for _ in range(10)],
    '銷售地區': ['客戶1', '客戶2', '客戶3', '客戶1', '客戶2', '客戶3', '客戶1', '客戶2', '客戶3', '客戶1']
}

# 使用真實的公司名稱和客戶名稱
real_companies = ['Apple Inc.', 'Microsoft Corporation', 'Amazon.com Inc.', 'Alphabet Inc.', 'Meta Platforms Inc.']
real_customers = ['Taiwan', 'Japan', 'Korea', 'Europe']

# 隨機替換公司名稱和客戶名稱
data['公司名稱'] = [random.choice(real_companies) for _ in range(10)]
data['銷售地區'] = [random.choice(real_customers) for _ in range(10)]

# 創建DataFrame
df_sales = pd.DataFrame(data)

# 顯示DataFrame
df_sales

          日期                   公司名稱  銷售量  銷售金額-USD    銷售地區
0 2023-01-01             Apple Inc.   70       817  Taiwan
1 2023-01-02  Microsoft Corporation   82       578   Japan
2 2023-01-03        Amazon.com Inc.   46       603   Japan
3 2023-01-04             Apple Inc.   53       529  Europe
4 2023-01-05    Meta Platforms Inc.  100       671  Taiwan
5 2023-01-06  Microsoft Corporation   86       542  Europe
6 2023-01-07    Meta Platforms Inc.   81       201   Korea
7 2023-01-08  Microsoft Corporation   74       662  Europe
8 2023-01-09    Meta Platforms Inc.   27       546   Japan
9 2023-01-10    Meta Platforms Inc.   28       159  Taiwan

In [310]:
df_sales.groupby('公司名稱')['銷售量'].sum()

公司名稱
Amazon.com Inc.           46
Apple Inc.               123
Meta Platforms Inc.      236
Microsoft Corporation    242
Name: 銷售量, dtype: int64

In [311]:
df_sales.groupby('公司名稱')[['銷售量','銷售金額-USD']].sum()

                       銷售量  銷售金額-USD
公司名稱
Amazon.com Inc.         46       603
Apple Inc.             123      1346
Meta Platforms Inc.    236      1577
Microsoft Corporation  242      1782

## 合併

In [313]:
cal_map = {
"銷售地區":"count",
"銷售量":['sum', 'mean'],
"銷售金額-USD":["max"]
}

df_sales.groupby('公司名稱').agg(cal_map)

                       銷售地區  銷售量            銷售金額-USD
                      count  sum       mean      max
公司名稱
Amazon.com Inc.           1   46  46.000000      603
Apple Inc.                2  123  61.500000      817
Meta Platforms Inc.       4  236  59.000000      671
Microsoft Corporation     3  242  80.666667      662

In [321]:
company = [
["Taiwan", "TSMC"],
["Taiwan", "MTK"],
["Taiwan", "ASUS"],
["Korea", "Samsung"],
["Korea", "LG"],
["Japan", "Sony"],
["Japan", "Murata"],
]

df_company = pd.DataFrame(company)
df_company.columns = ["銷售地區", "訂單客戶"]

df_company

     銷售地區     訂單客戶
0  Taiwan     TSMC
1  Taiwan      MTK
2  Taiwan     ASUS
3   Korea  Samsung
4   Korea       LG
5   Japan     Sony
6   Japan   Murata

In [322]:
pd.merge(df_sales, df_company, on='銷售地區')

           日期                   公司名稱  銷售量  銷售金額-USD    銷售地區     訂單客戶
0  2023-01-01             Apple Inc.   70       817  Taiwan     TSMC
1  2023-01-01             Apple Inc.   70       817  Taiwan      MTK
2  2023-01-01             Apple Inc.   70       817  Taiwan     ASUS
3  2023-01-05    Meta Platforms Inc.  100       671  Taiwan     TSMC
4  2023-01-05    Meta Platforms Inc.  100       671  Taiwan      MTK
5  2023-01-05    Meta Platforms Inc.  100       671  Taiwan     ASUS
6  2023-01-10    Meta Platforms Inc.   28       159  Taiwan     TSMC
7  2023-01-10    Meta Platforms Inc.   28       159  Taiwan      MTK
8  2023-01-10    Meta Platforms Inc.   28       159  Taiwan     ASUS
9  2023-01-02  Microsoft Corporation   82       578   Japan     Sony
10 2023-01-02  Microsoft Corporation   82       578   Japan   Murata
11 2023-01-03        Amazon.com Inc.   46       603   Japan     Sony
12 2023-01-03        Amazon.com Inc.   46       603   Japan   Murata
13 2023-01-09    Meta Platforms Inc.   27       546   Japan     Sony
14 2023-01-09    Meta Platforms Inc.   27       546   Japan   Murata
15 2023-01-07    Meta Platforms Inc.   81       201   Korea  Samsung
16 2023-01-07    Meta Platforms Inc.   81       201   Korea       LG

In [323]:
# 標準寫法 較嚴僅
pd.merge(df_sales, df_company, left_on='銷售地區', right_on="銷售地區", how="left")

           日期                   公司名稱  銷售量  銷售金額-USD    銷售地區     訂單客戶
0  2023-01-01             Apple Inc.   70       817  Taiwan     TSMC
1  2023-01-01             Apple Inc.   70       817  Taiwan      MTK
2  2023-01-01             Apple Inc.   70       817  Taiwan     ASUS
3  2023-01-02  Microsoft Corporation   82       578   Japan     Sony
4  2023-01-02  Microsoft Corporation   82       578   Japan   Murata
5  2023-01-03        Amazon.com Inc.   46       603   Japan     Sony
6  2023-01-03        Amazon.com Inc.   46       603   Japan   Murata
7  2023-01-04             Apple Inc.   53       529  Europe      NaN
8  2023-01-05    Meta Platforms Inc.  100       671  Taiwan     TSMC
9  2023-01-05    Meta Platforms Inc.  100       671  Taiwan      MTK
10 2023-01-05    Meta Platforms Inc.  100       671  Taiwan     ASUS
11 2023-01-06  Microsoft Corporation   86       542  Europe      NaN
12 2023-01-07    Meta Platforms Inc.   81       201   Korea  Samsung
13 2023-01-07    Meta Platforms Inc.   81       201   Korea       LG
14 2023-01-08  Microsoft Corporation   74       662  Europe      NaN
15 2023-01-09    Meta Platforms Inc.   27       546   Japan     Sony
16 2023-01-09    Meta Platforms Inc.   27       546   Japan   Murata
17 2023-01-10    Meta Platforms Inc.   28       159  Taiwan     TSMC
18 2023-01-10    Meta Platforms Inc.   28       159  Taiwan      MTK
19 2023-01-10    Meta Platforms Inc.   28       159  Taiwan     ASUS